import { Translations } from "./en"

const ar: Translations = {
  common: {
    ok: "نعم",
    cancel: "حذف",
    back: "خلف",
    next: "التالي",
    continue: "التالي",
  },
  walkthrough: {
    screen1: {
      text: `منطقة أحمد ما يوصلها ماء نظيف وهاي كانت مشكلة كبيرة بالنسبة اله ولأهل منطقته لفترة طويلة أحمد شاب ذكي ويعرف\n\n\n انه الحقوق تؤخذ ولا تعطى فراد يوصل صوته وأستخدم أول خياراته وهي السوشيال ميديا بس للأسف صرف هواي وكت وتعب وهو يناشد بدون فائدة !`,
    },
    screen2: {
      text: `صديق أحمد نصحه يسوي حملة جمع تواقيع حتى منطقته كلها توكف وياه والمسؤولين يعرفون حجم المشكلة وتأثيرها على حياتهم بس أحمد ما عده\n\n\n وقت وفلوس تساعده يروح على كل المنطقة حتى يوقعون على الحملة أحمد صار يدور طريقة \n\n\nيسوي هذا كله بسرعة وسهولة وهنا المفاجأة من اكتشف منصة رأي احمد نشر حملته \n\n\nبداخل المنصة وشاركها وي اهله واصدقاءه وأهل منطقته وكدر يجمع تواقيعهم بسرعة وسهولة وهو مرتاح`,
    },
    screen3: {
      text: `وصلت حملة أحمد للمسؤولين وانتبهوا على عدد التواقيع اللي جمعها ، وحسوا بأهمية المشكلة وفعلا سووا مشروع تصفية الماء أحمد كلش فرح من صار المشروع لان كدر يغير حياته وحياة اهل منطقته للأحسن أحمد وأهل منطقته عرفوا انه الشخص الواحد يكدر يغيّر حياة هواي ناس وبإمكان كل شخص يبادر ويصنع التغيير إله ولمجتمعه`,
    },
    screen4: {
      text: `وانت شنو تنتظر سجل بالمنصة اليوم وانشر حملتك الي تريد تغير بيها حياة الناس الي تحبهم ويهمك امرهم`,
    },
  },
  auth: {
    signIn: "تسجيل الدخول",
    signUp: "تسجيل",
    continueAsGuest: "متابعة كضيف",
  },
  signIn: {
    title: "تسجيل دخول",
    return: "رجوع",
    phoneNumber: "رقم الهاتف",
  },
  createAccount: {
    title: "إنشاء حساب",
    personal: "حساب شخصي",
    organization: "حساب منظمة",
  },
  welcomeScreen: {
    postscript:
      "ربما لا يكون هذا هو الشكل الذي يبدو عليه تطبيقك مالم يمنحك المصمم هذه الشاشات وشحنها في هذه الحالة",
    readyForLaunch: "تطبيقك تقريبا جاهز للتشغيل",
    exciting: "اوه هذا مثير",
  },
  thankyouScreen: {
    title: "حملة جديدة",
    headingTop: "يتم تحميل عريضة شكرا لك",
    headingBottom: "سيتم نشر الالتماس بعد مراجعته",
  },
  errorScreen: {
    title: "هناك خطأ ما",
    friendlySubtitle:
      "هذه هي الشاشة التي سيشاهدها المستخدمون في عملية الانتاج عند حدوث خطأ. سترغب في تخصيص هذه الرسالة ( الموجودة في 'ts.en/i18n/app') وربما التخطيط ايضاً ('app/screens/ErrorScreen'). إذا كنت تريد إزالة هذا بالكامل، تحقق من 'app/app.tsp' من اجل عنصر <ErrorBoundary>.",
    reset: "اعادة تعيين التطبيق",
  },
  emptyStateComponent: {
    generic: {
      heading: "فارغة جداً....حزين",
      content: "لا توجد بيانات حتى الآن. حاول النقر فوق الزر لتحديث التطبيق او اعادة تحميله.",
      button: "لنحاول هذا مرّة أخرى",
    },
  },
}

export default ar
